; domain
(define (domain simcity-simple)

;;complicatifications: cost, capacity of cars, parking (taxi does not have to park, parks can park only somewhere)

(:requirements :typing)

(:types 
	person
	location
	taxi - car 
        car underground - vehicle
)


(:predicates
  (at ?p - person ?l - location)
  (atv ?v - vehicle ?l - location)
  (in ?p - person ?v - vehicle)

  (walk-reachable ?from - location ?to - location)
  (car-reachable ?from - location ?to - location)
  (underground-reachable ?from - location ?to - location)

  (works-at ?p - person ?l - location)
  (worked ?p - person)

  (can-drive ?p - person ?v - vehicle)
  (can-board ?p - person ?v - vehicle)
)

(:action board
  :parameters 
    (?p - person ?l - location ?v - vehicle)
  :precondition
    (and 
      (at ?p ?l)
      (atv ?v ?l)
      (can-board ?p ?v)
    )
  :effect (and
    (in ?p ?v)
    (not (at ?p ?l))
  )
)

(:action disembark
  :parameters 
    (?p - person ?l - location ?v - vehicle)
  :precondition
    (and 
      (in ?p ?v)
      (atv ?v ?l)
    )
  :effect (and
    (not (in ?p ?v))
    (at ?p ?l)
  )
)

(:action walk
  :parameters 
    (?p - person ?from - location ?to - location)
  :precondition 
    (and
      (at ?p ?from)
      (walk-reachable ?from ?to)
    )
  :effect 
    (and
      (at ?p ?to)
      (not (at ?p ?from))
    )
)

(:action drive-car
  :parameters 
    (?p - person ?c - car ?from - location ?to - location)
  :precondition 
    (and
      (atv ?c ?from)
      (in ?p ?c)
      (car-reachable ?from ?to)
      (can-drive ?p ?c)
    )
  :effect 
    (and
      (atv ?c ?to)
      (not (atv ?c ?from))
    )
)

(:action drive-underground
  :parameters 
    (?p - person ?u - underground ?from - location ?to - location)
  :precondition 
    (and
      (atv ?u ?from)
      (in ?p ?u)
      (underground-reachable ?from ?to)
      (can-drive ?p ?u)
    )
  :effect 
    (and
      (atv ?u ?to)
      (not (atv ?u ?from))
    )
)


(:action work
  :parameters 
    (?p - person ?where - location)
  :precondition 
    (and
      (at ?p ?where)
      (works-at ?p ?where)
    )
  :effect 
    (and
      (worked ?p)
    )
)

(:action work-taxi
  :parameters 
    (?p - person ?t - taxi)
  :precondition 
    (and
      (in ?p ?t)
      (can-drive ?p ?t)
    )
  :effect 
    (and
      (worked ?p)
    )
)

(:action work-underground
  :parameters 
    (?p - person ?u - underground)
  :precondition 
    (and
      (in ?p ?u)
      (can-drive ?p ?u)
    )
  :effect 
    (and
      (worked ?p)
    )
)



)

; problem
(define (problem simcity1) (:domain simcity-simple) 
(:objects
  jan petr vaclav jana petra petruska ondrej - person
  prosek ippavlova karlak budejovicka butovice vinohrady staromak - location
  car1 - car
  taxi1 - taxi 
  metroC - underground
) 
(:init
  ;;graph
  (walk-reachable ippavlova karlak)
  (walk-reachable karlak ippavlova)
  (walk-reachable staromak karlak)
  (walk-reachable karlak staromak)
  (walk-reachable ippavlova vinohrady)
  (walk-reachable vinohrady ippavlova)

  (underground-reachable ippavlova prosek)
  (underground-reachable prosek ippavlova)
  (underground-reachable budejovicka ippavlova)
  (underground-reachable ippavlova budejovicka)

  (car-reachable butovice budejovicka)
  (car-reachable budejovicka butovice)
  (car-reachable butovice karlak)
  (car-reachable karlak butovice)
  (car-reachable butovice prosek)
  (car-reachable prosek butovice)
  (car-reachable prosek karlak)
  (car-reachable karlak prosek)
  (car-reachable prosek budejovicka)
  (car-reachable budejovicka prosek)
  (car-reachable vinohrady karlak)
  (car-reachable karlak vinohrady)

  ;;vehicles
  (atv car1 butovice)
  (atv taxi1 vinohrady)
  (atv metroC budejovicka)
  
  ;;janovi
  (at jan prosek)
  (works-at jan karlak)
  (can-board jan taxi1)
  (can-board jan metroC)
  (at jana prosek)
  (works-at jana vinohrady)
  (can-board jana taxi1)
  (can-board jana metroC)

  ;;petrovi
  (at petr butovice)
  (works-at petr budejovicka)
  (can-board petr car1)
  (can-drive petr car1)
  (can-board petr taxi1)
  (can-board petr metroC)
  (at petra butovice)
  (works-at petra prosek)
  (can-board petra taxi1)
  (can-board petra car1)
  (can-drive petra car1)
  (can-board petra metroC)
  (at petruska butovice)
  (works-at petruska staromak)
  (can-board petruska car1)
  (can-board petruska taxi1)
  (can-board petruska metroC)

  ;;vaclav
  (at vaclav vinohrady)
  (can-board vaclav taxi1)
  (can-drive vaclav taxi1)
  (can-board vaclav metroC)

  ;;ondrej
  (at ondrej budejovicka)
  (can-board ondrej taxi1)
  (can-board ondrej metroC)
  (can-drive ondrej metroC)

)

(:goal 
  (and
     (worked jan)
     (worked jana)
     (worked petr)
     (worked petra)
     (worked petruska)
     (worked vaclav)
     (worked ondrej)

     (at jan prosek)
     (at jana prosek)
     (at petr butovice)
     (at petra butovice)
     (at petruska butovice)
     (at vaclav vinohrady)
     (at ondrej budejovicka)
  )
)


)

; plan
1. (board vaclav vinohrady taxi1)
   deleted: (at vaclav vinohrady)
   added: (in vaclav taxi1)
   goals met: 6 of 14
2. (work-taxi vaclav taxi1)
   added: (worked vaclav)
   goals met: 7 of 14
3. (board ondrej budejovicka metroc)
   deleted: (at ondrej budejovicka)
   added: (in ondrej metroc)
   goals met: 6 of 14
4. (work-underground ondrej metroc)
   added: (worked ondrej)
   goals met: 7 of 14
5. (disembark ondrej budejovicka metroc)
   deleted: (in ondrej metroc)
   added: (at ondrej budejovicka)
   goals met: 8 of 14
6. (board petr butovice car1)
   deleted: (at petr butovice)
   added: (in petr car1)
   goals met: 7 of 14
7. (drive-car petr car1 butovice budejovicka)
   deleted: (atv car1 butovice)
   added: (atv car1 budejovicka)
   goals met: 7 of 14
8. (disembark petr budejovicka car1)
   deleted: (in petr car1)
   added: (at petr budejovicka)
   goals met: 7 of 14
9. (work petr budejovicka)
   added: (worked petr)
   goals met: 8 of 14
10. (board petr budejovicka car1)
   deleted: (at petr budejovicka)
   added: (in petr car1)
   goals met: 8 of 14
11. (drive-car petr car1 budejovicka butovice)
   deleted: (atv car1 budejovicka)
   added: (atv car1 butovice)
   goals met: 8 of 14
12. (disembark petr butovice car1)
   deleted: (in petr car1)
   added: (at petr butovice)
   goals met: 9 of 14
13. (board petra butovice car1)
   deleted: (at petra butovice)
   added: (in petra car1)
   goals met: 8 of 14
14. (drive-car petra car1 butovice prosek)
   deleted: (atv car1 butovice)
   added: (atv car1 prosek)
   goals met: 8 of 14
15. (disembark petra prosek car1)
   deleted: (in petra car1)
   added: (at petra prosek)
   goals met: 8 of 14
16. (work petra prosek)
   added: (worked petra)
   goals met: 9 of 14
17. (board petra prosek car1)
   deleted: (at petra prosek)
   added: (in petra car1)
   goals met: 9 of 14
18. (drive-car petra car1 prosek butovice)
   deleted: (atv car1 prosek)
   added: (atv car1 butovice)
   goals met: 9 of 14
19. (board petruska butovice car1)
   deleted: (at petruska butovice)
   added: (in petruska car1)
   goals met: 8 of 14
20. (drive-car petra car1 butovice karlak)
   deleted: (atv car1 butovice)
   added: (atv car1 karlak)
   goals met: 8 of 14
21. (disembark petruska karlak car1)
   deleted: (in petruska car1)
   added: (at petruska karlak)
   goals met: 8 of 14
22. (walk petruska karlak staromak)
   deleted: (at petruska karlak)
   added: (at petruska staromak)
   goals met: 8 of 14
23. (work petruska staromak)
   added: (worked petruska)
   goals met: 9 of 14
24. (walk petruska staromak karlak)
   deleted: (at petruska staromak)
   added: (at petruska karlak)
   goals met: 9 of 14
25. (board petruska karlak car1)
   deleted: (at petruska karlak)
   added: (in petruska car1)
   goals met: 9 of 14
26. (drive-car petra car1 karlak butovice)
   deleted: (atv car1 karlak)
   added: (atv car1 butovice)
   goals met: 9 of 14
27. (disembark petra butovice car1)
   deleted: (in petra car1)
   added: (at petra butovice)
   goals met: 10 of 14
28. (disembark petruska butovice car1)
   deleted: (in petruska car1)
   added: (at petruska butovice)
   goals met: 11 of 14
29. (drive-car vaclav taxi1 vinohrady karlak)
   deleted: (atv taxi1 vinohrady)
   added: (atv taxi1 karlak)
   goals met: 11 of 14
30. (drive-car vaclav taxi1 karlak prosek)
   deleted: (atv taxi1 karlak)
   added: (atv taxi1 prosek)
   goals met: 11 of 14
31. (board jan prosek taxi1)
   deleted: (at jan prosek)
   added: (in jan taxi1)
   goals met: 10 of 14
32. (board jana prosek taxi1)
   deleted: (at jana prosek)
   added: (in jana taxi1)
   goals met: 9 of 14
33. (drive-car vaclav taxi1 prosek karlak)
   deleted: (atv taxi1 prosek)
   added: (atv taxi1 karlak)
   goals met: 9 of 14
34. (disembark jan karlak taxi1)
   deleted: (in jan taxi1)
   added: (at jan karlak)
   goals met: 9 of 14
35. (work jan karlak)
   added: (worked jan)
   goals met: 10 of 14
36. (board jan karlak taxi1)
   deleted: (at jan karlak)
   added: (in jan taxi1)
   goals met: 10 of 14
37. (drive-car vaclav taxi1 karlak vinohrady)
   deleted: (atv taxi1 karlak)
   added: (atv taxi1 vinohrady)
   goals met: 10 of 14
38. (disembark jana vinohrady taxi1)
   deleted: (in jana taxi1)
   added: (at jana vinohrady)
   goals met: 10 of 14
39. (work jana vinohrady)
   added: (worked jana)
   goals met: 11 of 14
40. (board jana vinohrady taxi1)
   deleted: (at jana vinohrady)
   added: (in jana taxi1)
   goals met: 11 of 14
41. (drive-car vaclav taxi1 vinohrady karlak)
   deleted: (atv taxi1 vinohrady)
   added: (atv taxi1 karlak)
   goals met: 11 of 14
42. (drive-car vaclav taxi1 karlak prosek)
   deleted: (atv taxi1 karlak)
   added: (atv taxi1 prosek)
   goals met: 11 of 14
43. (disembark jan prosek taxi1)
   deleted: (in jan taxi1)
   added: (at jan prosek)
   goals met: 12 of 14
44. (disembark jana prosek taxi1)
   deleted: (in jana taxi1)
   added: (at jana prosek)
   goals met: 13 of 14
45. (drive-car vaclav taxi1 prosek karlak)
   deleted: (atv taxi1 prosek)
   added: (atv taxi1 karlak)
   goals met: 13 of 14
46. (drive-car vaclav taxi1 karlak vinohrady)
   deleted: (atv taxi1 karlak)
   added: (atv taxi1 vinohrady)
   goals met: 13 of 14
47. (disembark vaclav vinohrady taxi1)
   deleted: (in vaclav taxi1)
   added: (at vaclav vinohrady)
   goals met: 14 of 14
